CI4/app/Models/AdminModel.php

    public function getByUsername($username)
    {
        return $this->where('username', $username)->first();
---
SELECT *
FROM `admin`
WHERE `username` = 'admin'
 LIMIT 1