CI4/app/Models/MahasiswaModel.php

    public function getMahasiswa()
    {
        return $this->findAll();
---
SELECT *
FROM `mahasiswa`