CI4/app/Controllers/Mahasiswa.php

        }

        // Jika validasi lolos → simpan data
        $this->mahasiswaModel->save([
            'nim' => $this->request->getPost('nim'),
            'nama' => $this->request->getPost('nama'),
            'umur' => $this->request->getPost('umur'),
        ]);
---
INSERT INTO `mahasiswa` (`nim`, `nama`, `umur`) VALUES ('241511058', 'Revan Ramdani Permana', '13')

    public function edit($id)
    {
        $data['m'] = $this->mahasiswaModel->find($id);
---
SELECT *
FROM `mahasiswa`
WHERE `mahasiswa`.`id` = '2'

    }

    // Jika validasi lolos → update data
    $this->mahasiswaModel->update($id, [
        'nim' => $this->request->getPost('nim'),
        'nama' => $this->request->getPost('nama'),
        'umur' => $this->request->getPost('umur'),
    ]);
---
UPDATE `mahasiswa` SET `nim` = '24151102', `nama` = 'idham', `umur` = '13'
WHERE `mahasiswa`.`id` IN ('2')

    public function delete($id)
    {
        $this->mahasiswaModel->delete($id);
---
DELETE FROM `mahasiswa`
WHERE `id` IN ('8')